In [ ]:
# Select everything from the file celebs
SELECT * 
FROM celebs;

In [ ]:
# Create new table
CREATE TABLE celebs (
   id INTEGER, 
   name TEXT, 
   age INTEGER
);

In [ ]:
# Insert new values to an existing table
INSERT INTO celebs (id, name, age) 
VALUES (1, 'Justin Bieber', 22);

In [ ]:
# Insert new values to an existing table
INSERT INTO celebs (id, name, age) 
VALUES (1, 'Justin Bieber', 22); 

INSERT INTO celebs (id, name, age) 
VALUES (2, 'Beyonce Knowles', 33); 
 
INSERT INTO celebs (id, name, age) 
VALUES (3, 'Jeremy Lin', 26); 
 
INSERT INTO celebs (id, name, age) 
VALUES (4, 'Taylor Swift', 26);

In [ ]:
# Modify an existing table
ALTER TABLE celebs 
ADD COLUMN twitter_handle TEXT;

In [ ]:
# Editing a row in a table
UPDATE celebs 
SET twitter_handle = '@taylorswift13' 
WHERE id = 4;

In [ ]:
# Deleting a row in a table
DELETE FROM celebs 
WHERE twitter_handle IS NULL;

In [ ]:
 # Create a column using constraints
CREATE TABLE celebs (
   id INTEGER PRIMARY KEY, 
   name TEXT UNIQUE,
   date_of_birth TEXT NOT NULL,
   date_of_death TEXT DEFAULT 'Not Applicable'
   );

In [ ]:
 # Select from a speccific table
SELECT column1, column2 
FROM table_name;

In [ ]:
 # Using aliases
SELECT imdb_rating AS 'IMDb'
FROM movies;

In [ ]:
 # Select distinct values
SELECT DISTINCT year 
FROM movies;

In [ ]:
 # Using where 
SELECT * 
FROM movies 
WHERE year > 2014;

In [ ]:
 # Comparing similar values
SELECT * 
FROM movies
WHERE name LIKE 'Se_en';

In [ ]:
# Comparing similar values
SELECT * 
FROM movies
WHERE name LIKE 'The %';

In [ ]:
# Unknown values
SELECT name
FROM movies 
WHERE imdb_rating IS NULL;

In [ ]:
# Filter values
SELECT *
FROM movies
WHERE name BETWEEN 'D' AND 'G';

In [ ]:
# Filtering using AND
SELECT *
FROM movies
WHERE year < 1985
  AND genre = 'horror';

In [ ]:
# Using OR
SELECT *
FROM movies
WHERE genre = 'romance'
   OR genre = 'comedy';

In [ ]:
# Sorting results
SELECT name, year, imdb_rating
FROM movies
ORDER BY imdb_rating DESC;

In [ ]:
# Limiting number or results
SELECT *
FROM movies
ORDER BY imdb_rating DESC
LIMIT 3;

In [ ]:
# Creating different outputs
SELECT name,
 CASE
  WHEN genre = 'romance' THEN 'Chill'
  WHEN genre = 'comedy' THEN 'Chill'
  ELSE 'Intense'
 END AS 'Mood'
FROM movies;

In [ ]:
# Count rows on a table
SELECT COUNT(*) 
FROM fake_apps
WHERE price = 0;

In [ ]:
# Sum all specific values
SELECT SUM(downloads)
FROM fake_apps;

In [ ]:
# Min and max values
SELECT max(price)
FROM fake_apps;

In [ ]:
# Average value
SELECT AVG(price)
FROM fake_apps;

In [ ]:
# Rounded value
SELECT ROUND(AVG(price), 2)
FROM fake_apps;

In [ ]:
# Group by
SELECT category, SUM(downloads) 
FROM fake_apps
GROUP BY category;

In [ ]:
# Group by an specific calculation
SELECT category, 
   price,
   AVG(downloads)
FROM fake_apps
GROUP BY 1, 2;

In [ ]:
# Filtering groups to include and exclude
SELECT price, 
   ROUND(AVG(downloads)),
   COUNT(*)
FROM fake_apps
GROUP BY price
HAVING COUNT(*) > 10;

In [ ]:
# Multiple tables
SELECT *
FROM orders
LIMIT 5;
 
SELECT *
FROM subscriptions
LIMIT 5;
 
SELECT * 
FROM customers
LIMIT 5;

In [ ]:
# Combining two tables and selecting data from the resulting table
SELECT *
FROM orders
JOIN subscriptions
  ON orders.subscription_id = subscriptions.subscription_id;

SELECT *
FROM orders 
JOIN subscriptions
  ON orders.subscription_id = subscriptions.subscription_id
WHERE subscriptions.description = 'Fashion Magazine'

In [ ]:
# More JOINS
SELECT COUNT(*)
FROM newspaper;

SELECT COUNT(*)
FROM online;

SELECT COUNT(*)
FROM newspaper
JOIN online 
ON newspaper.id = online.id

In [ ]:
# left JOIN
SELECT *
FROM newspaper
LEFT JOIN online
  ON newspaper.id = online.id;
SELECT *
FROM newspaper
LEFT JOIN online
  ON newspaper.id = online.id
WHERE online.id IS NULL;

In [ ]:
# Cross JOIN
SELECT COUNT(*)
FROM newspaper
WHERE start_month <= 3 
  AND end_month >= 3;
SELECT *
FROM newspaper
CROSS JOIN months;
SELECT *
FROM newspaper
CROSS JOIN months
WHERE start_month <= month AND end_month >= month;
SELECT month,
   COUNT(*)
FROM newspaper
CROSS JOIN months
WHERE start_month <= month 
   AND end_month >= month
GROUP BY month;

In [ ]:
# Stacking datasets
SELECT * 
FROM newspaper 
UNION 
SELECT * 
FROM online;

In [ ]:
# Combining tables using WITH
WITH previous_query AS (
   SELECT customer_id,
      COUNT(subscription_id) AS 'subscriptions'
   FROM orders
   GROUP BY customer_id
)
SELECT customers.customer_name, 
   previous_query.subscriptions
FROM previous_query
JOIN customers
  ON previous_query.customer_id = customers.customer_id;